import java.util.Scanner;

public class Main {
    public static void main(String[] args) {
        while (true) {
            System.out.println("=============== Меню ===============");
            System.out.println("Что бы проверить задачу №1 введите => 1\nЧто бы проверить задачу №2 введите => 2\nЧто бы проверить задачу №3 введите => 3\nДля завершения введите => 0 ");
            System.out.println("====================================");
            Scanner in = new Scanner(System.in);
            int task = in.nextInt();
            if (task == 0) break;
            else if (task == 1) {
                System.out.println(" =========== Задача 1 ==================== ");
                System.out.print("Введите возраст: ");
                int age = in.nextInt();
                if (age < 0 ) {
                    System.out.println(" =====================================Результат================================================================ ");
                    System.out.println("Неверный возрас\n");
                    System.out.println(" ============================================================================================================== ");
                }
                else if ( age < 18){
                    System.out.println(" =====================================Результат================================================================ ");
                    System.out.println("Вы еще не совершеннолетний\n");
                    System.out.println(" ============================================================================================================== ");
                }
                else {
                    System.out.println(" =====================================Результат================================================================ ");
                    System.out.println("Вы стали взрослым\n");
                    System.out.println(" ============================================================================================================== ");
                }
            }
            else if (task == 2) {
                System.out.println(" =========== Задача 2 ==================== ");
                System.out.print(" Введите Зарплату сотрудника: ");
                int money = in.nextInt();
                System.out.print(" Введите количество лет которое проработал сотрудник: ");
                int years = in.nextInt();
                if ( (years >= 1 )  &&  (years <= 3 ) ){
                    int percent = money + ((money * 10) / 100);
                    if (percent <= 4000){
                        System.out.println(" =====================================Результат================================================================ ");
                        System.out.print("К выдаче сотруднику полагается зарплата = "+ (money) + ",  + 10 % =  " + (percent) + ",  + Борус = 1000, Итог = " + (money + percent + 1000) +  "\n");
                        System.out.println(" ============================================================================================================== ");
                    }
                    else {
                        System.out.println(" =====================================Результат================================================================ ");
                        System.out.print("К выдаче сотруднику полагается зарплата = "+ (money) + ", + 10 % = " + (percent) + ", Борус = 500, Итог =  " + (money + percent + 500)+ "\n");
                        System.out.println(" ============================================================================================================== ");
                    }
                }
                else if ( years > 3){
                    int percent = money + ((money * 20) / 100);
                    if (percent <= 4000){
                        System.out.println(" =====================================Результат================================================================ ");
                        System.out.print("К выдаче сотруднику полагается зарплата = "+ (money) + ",  + 10 % =  " + (percent) + ",  + Борус = 1000, Итог = " + (money + percent + 1000) +  "\n");
                        System.out.println(" ============================================================================================================== ");
                    }
                    else {
                        System.out.println(" =====================================Результат================================================================ ");
                        System.out.print("К выдаче сотруднику полагается зарплата = "+ (money) + ", + 10 % = " + (percent) + ", Борус = 500, Итог =  " + (money + percent + 500)+ "\n");
                        System.out.println(" ============================================================================================================== ");
                    }
                }
            }
            else if (task == 3) {
                System.out.println(" =========== Задача 3 ==================== ");
                int res = 0;
                for (int i = 1; i < 51; i++) {
                    res += i;
                }
                System.out.println(" =====================================Результат================================================================ ");
                System.out.println(" Результат сложения цифр от 1 до 50 = " + (res));
                System.out.println(" ============================================================================================================== ");
            }
        }
    }
}